class ResponseError {
    constructor(message) {
        this.message = message
    }
}

module.exports = ResponseError
//кстати нельзя переименовать common -> error ?
// ну планируется что тут будет ещё что-то кроме такого ответа. можешь по идее переименовать, но получится 1 папка строго для 1 класса
// что обыяно помещат в коммн помимо ошибки
// нет определенных правил. пихать можно всё, что относится к общему типу
// например: допустим работает с деньгами, можем засунуть в эту папку класс EntityMoney в котором будут разные поля
// можем засунуть сюда просто Response - общий формат ответа
// можно и ResponseList - общий формат ответа для списков
// правда тогда уж лучше папку response создать и туда засунуть все респонсы, ну а пока можно и так оставить, а можно переименовать
// не имеет значения
// оке тогда оставлю. сама смотри